In [1]:
import pandas as pd 
dict={"NAME":["Adam","Bob","Catherine","David","Eva"],
      "AGE":[24,25,20,22,23],
      "CITY":["Earth","Heaven","Hell","Unknown","Earth"]}
df=pd.DataFrame(dict)
print("head:")
print(df.head(2))
print("tail:")
print(df.tail(2))

head:
   NAME  AGE    CITY
0  Adam   24   Earth
1   Bob   25  Heaven
tail:
    NAME  AGE     CITY
3  David   22  Unknown
4    Eva   23    Earth

In [2]:
df.head()

        NAME  AGE     CITY
0       Adam   24    Earth
1        Bob   25   Heaven
2  Catherine   20     Hell
3      David   22  Unknown
4        Eva   23    Earth